## Pandas

### data manipulation library, data analysis and cleanig using Series and DataFrame

In [54]:
import pandas as pd

## Creating Series

### 1D array like object

#### From List

In [55]:
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

#### From Dict

In [56]:
data = {"a": 1, "b": 2, "c": 3}
series = pd.Series(data)
print(series)

a    1
b    2
c    3
dtype: int64

### Custom index in series

In [57]:
data = [10, 20, 30]
index = ["a", "b", "b"]
series = pd.Series(data, index=index)
print(series)

a    10
b    20
b    30
dtype: int64

## Creating DataFrame

### 2D array like object

### From Dict of Lists

In [58]:
data = {
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 35],
    "city": ["New York", "Los Angeles", "Chicago"],
}

df = pd.DataFrame(data)
print(df)

      name  age         city
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

### From List of Dicts

In [59]:
data = [
    {"name": "Alice", "age": 25, "city": "New York"},
    {"name": "Bob", "age": 30, "city": "Los Angeles"},
    {"name": "Charlie", "age": 35, "city": "Chicago"},
]

df = pd.DataFrame(data)
print(df)

      name  age         city
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

### From CSV

In [60]:
df = pd.read_csv("data.csv")
print(df)

        name  age        city
0  Sudhanshu   24   Hyderabad
1       Ansh   24        Pune
2       Jack   26  Coimbatore

## Indexing DataFrame

In [61]:
df = pd.read_csv("data.csv")

In [62]:
# Accessing columns
print(df["name"])

# Accessing rows
print(df[0:1])

0    Sudhanshu
1         Ansh
2         Jack
Name: name, dtype: object
        name  age       city
0  Sudhanshu   24  Hyderabad

In [63]:
# Accessing rows by index
print(df.iloc[0])
print(df.iloc[:, 0:2])

name    Sudhanshu
age            24
city    Hyderabad
Name: 0, dtype: object
        name  age
0  Sudhanshu   24
1       Ansh   24
2       Jack   26

In [64]:
# Accessing rows by label
print(df.loc[0])
print(df.loc[0:1, "name":"age"])

name    Sudhanshu
age            24
city    Hyderabad
Name: 0, dtype: object
        name  age
0  Sudhanshu   24
1       Ansh   24

In [65]:
# Accessing single value by index
print(df.iat[0, 2])

Hyderabad

In [66]:
# Accessing single value by label
print(df.at[0, "name"])

Sudhanshu

## Data Manipulation

### add new columns, remove columns, update values

In [67]:
df["salary"] = [50000, 60000, 70000]
print(df)

        name  age        city  salary
0  Sudhanshu   24   Hyderabad   50000
1       Ansh   24        Pune   60000
2       Jack   26  Coimbatore   70000

In [68]:
temp_df = df.copy()

In [69]:
temp_df.drop("city", axis=1, inplace=True)
print(temp_df)

        name  age  salary
0  Sudhanshu   24   50000
1       Ansh   24   60000
2       Jack   26   70000

In [70]:
temp_df["age"] = temp_df["age"] + 1
print(temp_df)

        name  age  salary
0  Sudhanshu   25   50000
1       Ansh   25   60000
2       Jack   27   70000

In [71]:
temp_df.drop(0, axis=0, inplace=True)
print(temp_df)

   name  age  salary
1  Ansh   25   60000
2  Jack   27   70000

## DataFrame Attributes

In [72]:
df.head()

        name  age        city  salary
0  Sudhanshu   24   Hyderabad   50000
1       Ansh   24        Pune   60000
2       Jack   26  Coimbatore   70000

In [73]:
df.dtypes

name      object
age        int64
city      object
salary     int64
dtype: object

In [74]:
df.describe()

             age   salary
count   3.000000      3.0
mean   24.666667  60000.0
std     1.154701  10000.0
min    24.000000  50000.0
25%    24.000000  55000.0
50%    24.000000  60000.0
75%    25.000000  65000.0
max    26.000000  70000.0

## Data Manipulation

In [75]:
df = pd.read_csv("data-2.csv")

In [76]:
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [77]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [78]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [79]:
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

### Handling Missing Values

In [80]:
df.isnull().any()

Date        False
Category    False
Value        True
Product     False
Sales        True
Region      False
dtype: bool

In [81]:
df.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

## Filling Missing Values

In [82]:
df["Sales_new"] = df["Sales"].fillna(df["Sales"].mean())
df

          Date Category  Value   Product  Sales Region   Sales_new
0   2023-01-01        A   28.0  Product1  754.0   East  754.000000
1   2023-01-02        B   39.0  Product3  110.0  North  110.000000
2   2023-01-03        C   32.0  Product2  398.0   East  398.000000
3   2023-01-04        B    8.0  Product1  522.0   East  522.000000
4   2023-01-05        B   26.0  Product3  869.0  North  869.000000
5   2023-01-06        B   54.0  Product3  192.0   West  192.000000
6   2023-01-07        A   16.0  Product1  936.0   East  936.000000
7   2023-01-08        C   89.0  Product1  488.0   West  488.000000
8   2023-01-09        C   37.0  Product3  772.0   West  772.000000
9   2023-01-10        A   22.0  Product2  834.0   West  834.000000
10  2023-01-11        B    7.0  Product1  842.0  North  842.000000
11  2023-01-12        B   60.0  Product2    NaN   West  557.130435
12  2023-01-13        A   70.0  Product3  628.0  South  628.000000
13  2023-01-14        A   69.0  Product1  423.0   East  423.000000
14  2023-01-15        A   47.0  Product2  893.0   West  893.000000
15  2023-01-16        C    NaN  Product1  895.0  North  895.000000
16  2023-01-17        C   93.0  Product2  511.0  South  511.000000
17  2023-01-18        C    NaN  Product1  108.0   West  108.000000
18  2023-01-19        A   31.0  Product2  578.0   West  578.000000
19  2023-01-20        A   59.0  Product1  736.0   East  736.000000
20  2023-01-21        C   82.0  Product3  606.0  South  606.000000
21  2023-01-22        C   37.0  Product2  992.0  South  992.000000
22  2023-01-23        B   62.0  Product3  942.0  North  942.000000
23  2023-01-24        C   92.0  Product2  342.0   West  342.000000
24  2023-01-25        A   24.0  Product2  458.0   East  458.000000
25  2023-01-26        C   95.0  Product1  584.0   West  584.000000
26  2023-01-27        C   71.0  Product2  619.0  North  619.000000
27  2023-01-28        C   56.0  Product2  224.0  North  224.000000
28  2023-01-29        B    NaN  Product3  617.0  North  617.000000
29  2023-01-30        C   51.0  Product2  737.0  South  737.000000
30  2023-01-31        B   50.0  Product3  735.0   West  735.000000
31  2023-02-01        A   17.0  Product2  189.0   West  189.000000
32  2023-02-02        B   63.0  Product3  338.0  South  338.000000
33  2023-02-03        C   27.0  Product3    NaN   East  557.130435
34  2023-02-04        C   70.0  Product3  669.0   West  669.000000
35  2023-02-05        B   60.0  Product2    NaN   West  557.130435
36  2023-02-06        C   36.0  Product3  177.0   East  177.000000
37  2023-02-07        C    2.0  Product1    NaN  North  557.130435
38  2023-02-08        C   94.0  Product1  408.0  South  408.000000
39  2023-02-09        A   62.0  Product1  155.0   West  155.000000
40  2023-02-10        B   15.0  Product1  578.0   East  578.000000
41  2023-02-11        C   97.0  Product1  256.0   East  256.000000
42  2023-02-12        A   93.0  Product3  164.0   West  164.000000
43  2023-02-13        A   43.0  Product3  949.0   East  949.000000
44  2023-02-14        A   96.0  Product3  830.0   East  830.000000
45  2023-02-15        B   99.0  Product2  599.0   West  599.000000
46  2023-02-16        B    6.0  Product1  938.0  South  938.000000
47  2023-02-17        B   69.0  Product3  143.0   West  143.000000
48  2023-02-18        C   65.0  Product3  182.0  North  182.000000
49  2023-02-19        C   11.0  Product3  708.0  North  708.000000

## Renaming columns

In [83]:
df = df.rename(columns={"Sales Daet": "Sales Date"})

In [84]:
df.dtypes

Date          object
Category      object
Value        float64
Product       object
Sales        float64
Region        object
Sales_new    float64
dtype: object

## Changing data types

In [85]:
df["Value_new"] = df["Value"].fillna(df["Value"].mean()).astype(int)
df.dtypes

Date          object
Category      object
Value        float64
Product       object
Sales        float64
Region        object
Sales_new    float64
Value_new      int64
dtype: object

In [86]:
df.head()

         Date Category  Value   Product  Sales Region  Sales_new  Value_new
0  2023-01-01        A   28.0  Product1  754.0   East      754.0         28
1  2023-01-02        B   39.0  Product3  110.0  North      110.0         39
2  2023-01-03        C   32.0  Product2  398.0   East      398.0         32
3  2023-01-04        B    8.0  Product1  522.0   East      522.0          8
4  2023-01-05        B   26.0  Product3  869.0  North      869.0         26

In [87]:
df["New value"] = df["Value_new"].apply(lambda x: x * 2)
df.head()

,Date,Category,Value,Product,Sales,Region,Sales_new,Value_new,New value
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28,56
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39,78
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,32,64
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,8,16
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,26,52

## Data Aggregating and Grouping

In [88]:
df.head()

,Date,Category,Value,Product,Sales,Region,Sales_new,Value_new,New value
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28,56
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39,78
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,32,64
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,8,16
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,26,52

In [89]:
# Sales mean by Product
grouped_mean = df.groupby("Product")["Sales"].mean()
print(grouped_mean)

Product
Product1    574.866667
Product2    567.230769
Product3    535.055556
Name: Sales, dtype: float64

In [90]:
# Sales sum by Product and Region
grouped_mean_region = df.groupby(["Product", "Region"])["Sales"].sum()
print(grouped_mean_region)

Product   Region
Product1  East      4205.0
          North     1737.0
          South     1346.0
          West      1335.0
Product2  East       856.0
          North      843.0
          South     2240.0
          West      3435.0
Product3  East      1956.0
          North     3428.0
          South     1572.0
          West      2675.0
Name: Sales, dtype: float64

In [91]:
# Aggregate multiple function
grouped_agg = df.groupby(["Product", "Region"])["Sales"].aggregate(["sum", "mean"])
print(grouped_agg)

                    sum        mean
Product  Region
Product1 East    4205.0  600.714286
         North   1737.0  868.500000
         South   1346.0  673.000000
         West    1335.0  333.750000
Product2 East     856.0  428.000000
         North    843.0  421.500000
         South   2240.0  746.666667
         West    3435.0  572.500000
Product3 East    1956.0  652.000000
         North   3428.0  571.333333
         South   1572.0  524.000000
         West    2675.0  445.833333

## Mergind and Joining DataFrame

In [92]:
df1_data = { "Product": ["A", "B", "C"], "Price": [10, 20, 30] }
df1 = pd.DataFrame(df1_data);
df2_data = { "Product": ["A", "B", "D"], "Sales": [100, 200, 300] }
df2 = pd.DataFrame(df2_data);

In [93]:
df1

  Product  Price
0       A     10
1       B     20
2       C     30

In [94]:
df2

  Product  Sales
0       A    100
1       B    200
2       D    300

In [95]:
# Merge on Product Column (similar to SQL JOINS)
# how - inner, left, right, outer
pd.merge(df1, df2, on="Product", how="outer")

  Product  Price  Sales
0       A   10.0  100.0
1       B   20.0  200.0
2       C   30.0    NaN
3       D    NaN  300.0

## Reading data from different sources

### From JSON String

In [96]:
from io import StringIO

json_data = '''
[
  {"employee_name": "James", "email": "james@gmail.com", "job_profile": "Team Lead"},
  {"employee_name": "Michael", "email": "michael@gmail.com", "job_profile": "Senior Developer"}
]
'''
df = pd.read_json(StringIO(json_data))
print(df)

  employee_name              email       job_profile
0         James    james@gmail.com         Team Lead
1       Michael  michael@gmail.com  Senior Developer

In [97]:
# JSON of DataFrame
json = df.to_json()
json

'{"employee_name":{"0":"James","1":"Michael"},"email":{"0":"james@gmail.com","1":"michael@gmail.com"},"job_profile":{"0":"Team Lead","1":"Senior Developer"}}'

In [98]:
# String as list of records
json_records = df.to_json(orient="records")
json_records

'[{"employee_name":"James","email":"james@gmail.com","job_profile":"Team Lead"},{"employee_name":"Michael","email":"michael@gmail.com","job_profile":"Senior Developer"}]'

### From CSV - URL

In [99]:
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data'
df_csv = pd.read_csv(url, header=None)

In [100]:
df_csv.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [101]:
# Save DataFrame to CSV
df_csv.to_csv("wine_data.csv", index=False)

### From HTML

In [102]:
url_html = 'https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/'
df_list = pd.read_html(url_html)
# Number of tables found
print(len(df_list))

# Display first table
df_list[0].head()

1

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545

In [103]:
url_wiki = 'https://en.wikipedia.org/wiki/Mobile_country_code'

# filter tables containing a specific keyword
df_country = pd.read_html(url_wiki, match='Country', header=0)
df_country[0].head()

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN

### From Excel

In [104]:
df_excel = pd.read_excel('data.xlsx', sheet_name=0)
df_excel.head()

    Name  Age
0  Krish   32
1   Jack   34
2   John   31

### From Pickle

In [105]:
df_excel.to_pickle("data.pkl")

In [106]:
df_pickle = pd.read_pickle("data.pkl")
df_pickle

    Name  Age
0  Krish   32
1   Jack   34
2   John   31

## Many other function
#### read_sql
#### read_sql_query
#### read_table
#### read_xml